app/controllers/chat_controller.rb

INSERT INTO "messages" ("updated_at", "body", "created_by", "created_at") VALUES('2009-05-03 19:47:22', 'wee!', NULL, '2009-05-03 19:47:22')
---
  def send_data
    @message = Message.create( :body => params[:chat_input], :created_by => session[:user_name] )